
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * module.civil_sdt_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-servicebus-connection-string/f96fffe1ad5e4f459bfa5030f6f46284"
        name                    = "civil-sdt-servicebus-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
        id                      = "https://civil-sdt-aat.vault.azure.net/secrets/civil-sdt-servicebus-shared-access-key/979a3a97a1fc444787a6625c2eb64a6c"
        name                    = "civil-sdt-servicebus-shared-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.civil_sdt_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.KeyVault/vaults/civil-sdt-aat|civil-sdt-aat"
        name                           = "civil-sdt-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace must be replaced
-/+ resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      ~ capacity                            = 1 -> 0
      ~ default_primary_connection_string   = (sensitive value)
      ~ default_primary_key                 = (sensitive value)
      ~ default_secondary_connection_string = (sensitive value)
      ~ default_secondary_key               = (sensitive value)
      ~ endpoint                            = "https://civil-sdt-servicebus-aat.servicebus.windows.net:443/" -> (known after apply)
      ~ id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" -> (known after apply)
      ~ minimum_tls_version                 = "1.2" -> (known after apply)
        name                                = "civil-sdt-servicebus-aat"
      ~ sku                                 = "Premium" -> "Standard" # forces replacement
        tags                                = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#civil-sdt"
            "application"         = "civil"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/civil-sdt.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
      ~ zone_redundant                      = true -> false # forces replacement
        # (4 unchanged attributes hidden)

      - network_rule_set {
          - default_action                = "Allow" -> null
          - ip_rules                      = [] -> null
          - public_network_access_enabled = true -> null
          - trusted_services_allowed      = false -> null
        }
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/authorizationRules/SendAndListenSharedAccessKey" -> (known after apply)
        name                              = "SendAndListenSharedAccessKey"
      ~ namespace_id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_servicebus_namespace" "this" {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + endpoint                            = (known after apply)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "civil-sdt-servicebus-aat"
      + resource_group_name                 = "civil-sdt-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue must be replaced
-/+ resource "azurerm_servicebus_queue" "servicebus_queue" {
      ~ id                                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
        name                                    = "civil-sdt-in-out-aat"
      ~ namespace_id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat" # forces replacement -> (known after apply) # forces replacement
        # (13 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/ListenSharedAccessKey" -> (known after apply)
        name                              = "ListenSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule must be replaced
-/+ resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat/authorizationRules/SendSharedAccessKey" -> (known after apply)
        name                              = "SendSharedAccessKey"
      ~ primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      ~ primary_key                       = (sensitive value)
      ~ queue_id                          = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-sdt-aat/providers/Microsoft.ServiceBus/namespaces/civil-sdt-servicebus-aat/queues/civil-sdt-in-out-aat" # forces replacement -> (known after apply) # forces replacement
      ~ secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      ~ secondary_key                     = (sensitive value)
        # (3 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":296,"Program":"tfcmt","SHA1":"","Vars":{}} -->